/*

DRY মানে হচ্ছে Don’t Repeat Yourself. এর আসল উদ্দেশ্য হচ্ছে বারবার 
একই কাজ না করে সেটা কিভাবে শর্ট করে, সুন্দর করে করা যায়
এখানে মেইন উদ্দেশ্য একই কোড রিপিট না করা

**** 1. ধরি, আমরা দুইটা নাম্বারের যোগফল চাচ্ছি। এখন বারবার দুইটা নাম্বার যোগ করে, 
একটা ফাংশন নিয়ে ফাংশনে আর্গুমেন্ট হিসেবে নাম্বারগুলো পাঠিয়ে কাজ সেরে ফেলতে পারিঃ

*/

// 1(answer)

// function addTwoNum(x, y) {
//     const sum = x + y;
//     console.log('Sum of ' + x + ' and ' + y + ' is: ' + sum);
//  }

// addTwoNum(5, 10);
// addTwoNum(20, 30);
// addTwoNum(40, 50);
// addTwoNum(60, 70);
// addTwoNum(80, 90);


